let data = [{ 
  "YETI 120 FR" : {
    "size" : {
      "Сухой вес передней части"  : "8,1 кг",
      "Сухой вес задний части"  : "40,8 кг",
      "Общая длина" : "167,6 см",
      "Общая высота" : "50,8 см",
      "Общая ширина" : "40,64 смг"
    },
    "caterpillar" : {
      "Модель"  : "Гусеница для сноубайка Camso 9444S",
      "Длина"  : "304,8 см",
      "Ширина" : "31,75 см",
      "Шаг" : "7,26 см",
      "Высота зацепа" : "6,6 см",
      "Расстояние между полозами" : "13,97 см"
    },
    "maxkeel" : {
      "Дизайн лыжи"  : "Параболическая форма, радиус 50,8 см (20)",
      "Длина лыжи"  : "106,68 см",
      "Материал" : "Полимер сверхвысокой плотности UHMW",
      "Тип конька" : "Оцинкованная сталь Hardox"
    },
    "chassis" : {
      "Шасси"  : "Карбоновое волокно",
      "Скользящая шетсерня цепи"  : "Стандартная POM",
      "Автоматический натяжитель цепи" : "Стандартный POM",
      "Тормозная система" : "Hayes V32 – Двухпоршневой суппорт, защищенный ротор",
      "Главный тормозной цилиндр" : "Hayes с предварительной прокачкой, под правую руку,ход поршня 11 мм",
      "Синхропривод, ременная система" : "Mitsuboshi 28 мм / 896 мм (ширина / длина)",
      "Ременной привод быстрого доступа" : "LEXAN",
      "Приводная цепь" : "DID520VOX 60 или 62 звена (соединительное звено)",
      "Приводной вал" : "1 1/16' шестигранный, титан, 7-зубая противореверсивная звезда'",
      "Звезда приводного вала" : "16 зубов – шлицевая",
      "Верхняя передача ременного синхропривода" : "41 зуб – шлицевая",
      "Нижняя передача ременного синхропривода" : "47 зубов – шлицевая",
      "Крепежные элементы и арматура" : "Титан, анодированный алюминий, нержавеющая сталь"
    },
    "suspension" : {
      "Передний и задний амортизатор"  : "Elka Shock Stage 3",
      "Задний рычаг подвески"  : "Алюминий 6061-T6",
      "Передний рычаг подвески" : "Сталь с порошковым покрытием и армированием STRENX",
      "Ход задней подвески"  : "16.0' (40,64 см)'",
      "Стойка"  : "16.0 дюймов (40.64 см) YETI Soft Strut",
    }
  },
  "YETI 120 SS" : {
  	"size" : {
  		"Сухой вес передней части"  : "8,1 кг",
    	"Сухой вес задний части"  : "39,9 кг",
    	"Общая длина" : "167,6 см",
    	"Общая высота" : "50,8 см",
    	"Общая ширина" : "39,37 смг"
  	},
    "caterpillar" : {
  		"Модель"  : "Гусеница для сноубайка Camso RACE",
    	"Длина"  : "304,8 см",
    	"Ширина" : "25,4 см",
      "Шаг" : "7,26 см",
      "Высота зацепа" : "4,83 см",
      "Расстояние между полозами" : "13,97 см"
  	},
  	"maxkeel" : {
      "Дизайн лыжи"  : "Параболическая форма, радиус 50,8 см (20)",
      "Длина лыжи"  : "106,68 см",
      "Материал" : "Полимер сверхвысокой плотности UHMW",
      "Тип конька" : "Оцинкованная сталь Hardox"
    },
  	"chassis" : {
  		"Шасси"  : "Карбоновое волокно Прозрачное покрытие",
    	"Скользящая шетсерня цепи"  : "Indian Ocean",
    	"Автоматический натяжитель цепи" : "987",
      "Тормозная система" : "Заказной суппорт / двухпоршневой тормоз",
      "Главный тормозной цилиндр" : "Гидролиния мотоцикла",
      "Синхропривод, ременная система" : "Mitsuboshi 28 мм / 896 мм (ширина / длина)",
      "Ременной привод быстрого доступа" : "LEXAN",
      "Приводная цепь" : "DID520VOX 60 или 62 звена (соединительное звено)",
      "Приводной вал" : "1 1/16 дюймов шестигранный, титан, 7-зубая противореверсивная звезда'",
      "Звезда приводного вала" : "16 зубов – шлицевая",
      "Верхняя передача ременного синхропривода" : "41 зуб – шлицевая",
      "Нижняя передача ременного синхропривода" : "47 зубов – шлицевая",
      "Крепежные элементы и арматура" : "Титан, анодированный алюминий, нержавеющая сталь"
  	},
  	"suspension" : {
  		"Передний и задний амортизатор"  : "Elka Shock Stage 5",
    	"Задний рычаг подвески"  : "Алюминий",
    	"Передний рычаг подвески" : "Сталь с порошковым покрытием и армированием STRENX",
      "Ход задней подвески"  : "16.0 дюймов (40,64 см)'",
      "Стойка"  : "16.0 дюймов (40.64 см) YETI Soft Strut",
  	}
  },
  "YETI 129 FR" : {
    "size" : {
      "Сухой вес передней части"  : "8,1 кг",
      "Сухой вес задний части"  : "42,64 кг",
      "Общая длина" : "175,3 см",
      "Общая высота" : "50,8 см",
      "Общая ширина" : "40,64 смг"
    },
    "caterpillar" : {
      "Модель"  : "Гусеница для сноубайка Camso 9443S",
      "Длина"  : "327,66 см",
      "Ширина" : "31,75 см",
      "Шаг" : "7,26 см",
      "Высота зацепа" : "6,6 см",
      "Расстояние между полозами" : "13,97 см"
    },
    "maxkeel" : {
      "Дизайн лыжи"  : "Параболическая форма, радиус 50,8 см (20)",
      "Длина лыжи"  : "106,68 см",
      "Материал" : "Полимер сверхвысокой плотности UHMW",
      "Тип конька" : "Оцинкованная сталь Hardox"
    },
    "chassis" : {
      "Шасси"  : "Карбоновое волокно Прозрачное покрытие",
      "Скользящая шетсерня цепи"  : "Indian Ocean",
      "Автоматический натяжитель цепи" : "987",
      "Тормозная система" : "Hayes V32 – Двухпоршневой суппорт, защищенный ротор",
      "Главный тормозной цилиндр" : "Hayes с предварительной прокачкой, под правую руку, ход поршня 11 мм",
      "Синхропривод, ременная система" : "Mitsuboshi 28 мм / 896 мм (ширина / длина)",
      "Ременной привод быстрого доступа" : "LEXAN",
      "Приводная цепь" : "DID520VOX 60 или 62 звена (соединительное звено)",
      "Приводной вал" : "1 1/16' шестигранный, титан, 7-зубая противореверсивная звезда'",
      "Звезда приводного вала" : "16 зубов – шлицевая",
      "Верхняя передача ременного синхропривода" : "41 зуб – шлицевая",
      "Нижняя передача ременного синхропривода" : "47 зубов – шлицевая",
      "Крепежные элементы и арматура" : "Титан, анодированный алюминий, нержавеющая сталь"
    },
    "suspension" : {
      "Передний и задний амортизатор"  : "Elka Shock Stage 3",
      "Задний рычаг подвески"  : "Алюминий 6061-T6",
      "Передний рычаг подвески" : "Сталь с порошковым покрытием и армированием STRENX",
      "Ход задней подвески"  : "16.0 дюймов (40,64 см)'",
      "Стойка"  : "16.0 дюймов (40.64 см) YETI Soft Strut",
    }
  },
  "YETI 137 MT" : {
    "size" : {
      "Сухой вес передней части"  : "8,1 кг",
      "Сухой вес задний части"  : "44,91 кг",
      "Общая длина" : "185,4 см",
      "Общая высота" : "50,8 см",
      "Общая ширина" : "40,64 смг"
    },
    "caterpillar" : {
      "Модель"  : "Гусеница для сноубайка Camso 9429S",
      "Длина"  : "347,98 см",
      "Ширина" : "31,75 см",
      "Шаг" : "7,26 см",
      "Высота зацепа" : "6,6 см",
      "Расстояние между полозами" : "13,97 см"
    },
    "maxkeel" : {
      "Дизайн лыжи"  : "Параболическая форма, радиус 50,8 см (20)",
      "Длина лыжи"  : "106,68 см",
      "Материал" : "Полимер сверхвысокой плотности UHMW",
      "Тип конька" : "Оцинкованная сталь Hardox"
    },
    "chassis" : {
      "Шасси"  : "Карбоновое волокно Прозрачное покрытие",
      "Скользящая шетсерня цепи"  : "Indian Ocean",
      "Автоматический натяжитель цепи" : "987",
      "Тормозная система" : "Hayes V32 - Двухпоршневой суппорт, защищенный ротор",
      "Главный тормозной цилиндр" : "Hayes с предварительной прокачкой, под правую руку, ход поршня 11 мм",
      "Синхропривод, ременная система" : "Mitsuboshi 28 мм / 896 мм (ширина / длина)",
      "Ременной привод быстрого доступа" : "LEXAN",
      "Приводная цепь" : "DID520VOX 60 или 62 звена (соединительное звено)",
      "Приводной вал" : "1 1/16' шестигранный, титан, 7-зубая противореверсивная звезда'",
      "Звезда приводного вала" : "16 зубов – шлицевая",
      "Верхняя передача ременного синхропривода" : "41 зуб – шлицевая",
      "Нижняя передача ременного синхропривода" : "47 зубов – шлицевая",
      "Крепежные элементы и арматура" : "Титан, анодированный алюминий, нержавеющая сталь"
    },
    "suspension" : {
      "Передний и задний амортизатор"  : "Elka Shock Stage 3",
      "Задний рычаг подвески"  : "Алюминий 6061-T6",
      "Передний рычаг подвески" : "Сталь с порошковым покрытием и армированием STRENX",
      "Ход задней подвески"  : "16.0 дюймов (40,64 см)'",
      "Стойка"  : "16.0 дюймов (40.64 см) YETI Soft Strut",
    }
  }
}];


console.log(data[0])
let leftbuttons = document.querySelectorAll('.left-item');

let firstSlide = leftbuttons[0];
changeCatalog(firstSlide);

leftbuttons.forEach((item) => {
	item.addEventListener("click",
	  function(event) {
	  	let nameyeti = event.target
	    
      for (let sibling of event.target.parentNode.children) {
            sibling.classList.remove('active');
      }
      changeCatalog(nameyeti);
	  }
	);
})

function changeCatalog(elyeti) {
  let nameyeti = elyeti.textContent;
  elyeti.classList.add('active');

  changePart(nameyeti, 'caterpillar');
  changePart(nameyeti, 'chassis');
  changePart(nameyeti, 'maxkeel');
  changePart(nameyeti, 'suspension');
  changePart(nameyeti, 'size');

}

function changePart(nameyeti, namePart) {
  let catalog = document.querySelector('.catalog-content');
  let gallery = catalog.querySelector('.catalog-image');
  let table = catalog.querySelector(`.${namePart}`);
  let wrap = table.querySelector('.table-content');

  let orderBtn = document.querySelector('.catalog-order');

  orderBtn.href = `javascript:PopUpShow2('${nameyeti}')`;

  gallery.src = `img/yeti/${nameyeti}.png`;

  wrap.innerHTML = '';

  data.forEach((item) => {
    console.log(data)
    console.log(item)
    console.log(item[nameyeti])
    console.log(item[nameyeti][namePart])  

    let spisok = item[nameyeti][namePart];

    for (var key in spisok) {
      let content = `<div class="table-item row">
                        <div>${key}</div><div>${spisok[key]}</div>
                      </div>`
      wrap.insertAdjacentHTML('beforeend', content); 
    }
  })
}

